from class_lib import Sort

obj1 = Sort(3)
obj1.print()

# Розподілення на класи
#------------------------------------------------
# 1) Сортування
#   змінні
#       вибір користувача
#       масив?
#   методи
#       a)	швидкого сортування;
#       b)  інтроспективне сортування;
#       c)  сортування злиттям (Д. фон Неймана);
#
#-------------------------------------------------
# 2) Масив
#   змінні
#       розмір
#       діапазон
#   методи
#       генерація масиву
#       виведення масиву
#
#-------------------------------------------------
# 3) Інтерфейс
#   змінні
#       ...
#       ...
#   методи
#       ...
#       ...
#-------------------------------------------------
# 4) Алгоритм
#   змінні
#       ...
#       ...
#   методи
#       ...
#       ...
#-------------------------------------------------

